In [44]:
import numpy as np
import pandas as pd
import re

In [4]:
df = pd.read_csv(r"C:\Users\User\Documents\GitHub\Praxisprojekt_Modul_2.2_Breakout2\Daten\Daten_Aufgabe_1 - Shopauswertung.csv", sep=";")
df

           Datum Produkt         Umsatz
0     01.01.2021       A      17.132115
1     02.01.2021       A      57.353725
2     03.01.2021       A     114.746857
3     04.01.2021       A     113.251181
4     05.01.2021       A       4.186462
...          ...     ...            ...
1090  27.12.2021   A+B+C  197909.241600
1091  28.12.2021   A+B+C  198014.840500
1092  29.12.2021   A+B+C  198355.276000
1093  30.12.2021   A+B+C  199081.446100
1094  31.12.2021   A+B+C  199213.853100

[1095 rows x 3 columns]

In [13]:
df_d = pd.read_excel(r"C:\Users\User\Documents\GitHub\Praxisprojekt_Modul_2.2_Breakout2\Daten\Daten_Aufgabe_1 - Shop Analyse.xlsx",sheet_name=["P1","P2", "P3"])
df_d

{'P1':    Datum        Umsatz
 0    Jan  15562.548244
 1    Feb  14055.574404
 2    Mrz  15633.906605
 3    Apr  15792.846962
 4    Mai  16947.490126
 5    Jun  17082.748897
 6    Jul  17965.029742
 7    Aug  17720.174104
 8    Sep  16870.277769
 9    Okt  17579.239012
 10   Nov  17567.793719
 11   Dez  18653.342190,
 'P2':    Datum        Umsatz
 0    Jan  14774.456985
 1    Feb  15176.474454
 2    Mrz  18280.334382
 3    Apr  19095.318361
 4    Mai  20206.106573
 5    Jun  20056.650473
 6    Jul  22288.143627
 7    Aug  21707.813329
 8    Sep  21084.843997
 9    Okt  21564.908777
 10   Nov  20566.410979
 11   Dez  22364.237781,
 'P3':    Datum         Umsatz
 0    Jan  148945.166650
 1    Feb  128859.949494
 2    Mrz  141602.709028
 3    Apr  133780.491099
 4    Mai  135993.779232
 5    Jun  135206.767009
 6    Jul  143531.783519
 7    Aug  139714.627028
 8    Sep  130178.025891
 9    Okt  128966.717912
 10   Nov  122411.822565
 11   Dez  126539.078674}

In [20]:
a= df_d["P1"].values
df_A = pd.DataFrame(a, columns=["Monat", "Produkt_A_Inland"])
df_A

   Monat Produkt_A_Inland
0    Jan     15562.548244
1    Feb     14055.574404
2    Mrz     15633.906605
3    Apr     15792.846962
4    Mai     16947.490126
5    Jun     17082.748897
6    Jul     17965.029742
7    Aug     17720.174104
8    Sep     16870.277769
9    Okt     17579.239012
10   Nov     17567.793719
11   Dez      18653.34219

In [21]:
b= df_d["P2"].values
df_B = pd.DataFrame(b, columns=["Monat", "Produkt_B_Inland"])
df_B

   Monat Produkt_B_Inland
0    Jan     14774.456985
1    Feb     15176.474454
2    Mrz     18280.334382
3    Apr     19095.318361
4    Mai     20206.106573
5    Jun     20056.650473
6    Jul     22288.143627
7    Aug     21707.813329
8    Sep     21084.843997
9    Okt     21564.908777
10   Nov     20566.410979
11   Dez     22364.237781

In [22]:
c= df_d["P3"].values
df_C = pd.DataFrame(c, columns=["Monat", "Produkt_C_Inland"])
df_C

   Monat Produkt_C_Inland
0    Jan     148945.16665
1    Feb    128859.949494
2    Mrz    141602.709028
3    Apr    133780.491099
4    Mai    135993.779232
5    Jun    135206.767009
6    Jul    143531.783519
7    Aug    139714.627028
8    Sep    130178.025891
9    Okt    128966.717912
10   Nov    122411.822565
11   Dez    126539.078674

In [25]:
df_inland= df_A.merge(df_B)

In [26]:
df_inland = df_inland.merge(df_C)

In [27]:
df_inland

   Monat Produkt_A_Inland Produkt_B_Inland Produkt_C_Inland
0    Jan     15562.548244     14774.456985     148945.16665
1    Feb     14055.574404     15176.474454    128859.949494
2    Mrz     15633.906605     18280.334382    141602.709028
3    Apr     15792.846962     19095.318361    133780.491099
4    Mai     16947.490126     20206.106573    135993.779232
5    Jun     17082.748897     20056.650473    135206.767009
6    Jul     17965.029742     22288.143627    143531.783519
7    Aug     17720.174104     21707.813329    139714.627028
8    Sep     16870.277769     21084.843997    130178.025891
9    Okt     17579.239012     21564.908777    128966.717912
10   Nov     17567.793719     20566.410979    122411.822565
11   Dez      18653.34219     22364.237781    126539.078674

In [29]:
df_inland.set_index("Monat", inplace=True)

In [30]:
df_inland

      Produkt_A_Inland Produkt_B_Inland Produkt_C_Inland
Monat
Jan       15562.548244     14774.456985     148945.16665
Feb       14055.574404     15176.474454    128859.949494
Mrz       15633.906605     18280.334382    141602.709028
Apr       15792.846962     19095.318361    133780.491099
Mai       16947.490126     20206.106573    135993.779232
Jun       17082.748897     20056.650473    135206.767009
Jul       17965.029742     22288.143627    143531.783519
Aug       17720.174104     21707.813329    139714.627028
Sep       16870.277769     21084.843997    130178.025891
Okt       17579.239012     21564.908777    128966.717912
Nov       17567.793719     20566.410979    122411.822565
Dez        18653.34219     22364.237781    126539.078674

In [51]:
df_inland["Produkt_A_Inland"]=df_inland["Produkt_A_Inland"].astype("float").round(2)
df_inland["Produkt_B_Inland"]=df_inland["Produkt_C_Inland"].astype("float").round(2)
df_inland["Produkt_C_Inland"]=df_inland["Produkt_C_Inland"].astype("float").round(2)

In [52]:
df_inland

       Produkt_A_Inland  Produkt_B_Inland  Produkt_C_Inland
Monat
Jan            15562.55         148945.17         148945.17
Feb            14055.57         128859.95         128859.95
Mrz            15633.91         141602.71         141602.71
Apr            15792.85         133780.49         133780.49
Mai            16947.49         135993.78         135993.78
Jun            17082.75         135206.77         135206.77
Jul            17965.03         143531.78         143531.78
Aug            17720.17         139714.63         139714.63
Sep            16870.28         130178.03         130178.03
Okt            17579.24         128966.72         128966.72
Nov            17567.79         122411.82         122411.82
Dez            18653.34         126539.08         126539.08

In [53]:
df_inland.to_csv(r"C:\Users\User\Documents\GitHub\Praxisprojekt_Modul_2.2_Breakout2\Daten\Umsatz_Inland.csv")